# #+TITLE: Implementing parallelism in Lisp for REDUCE
# #+SUBTITLE: Computer Science Part II Project
# #+AUTHOR: Andrei Vlad Badelita
# #+EMAIL: avb40@cam.ac.uk

#+OPTIONS: toc:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper, 12pt]
#+LATEX_HEADER: \usepackage[margin=3cm]{geometry}
# #+LATEX_HEADER: \pagenumbering{roman}
# #+LATEX_HEADER_EXTRA:
#+DATE: \today

#+BEGIN_EXPORT latex
% Title

\pagestyle{empty}

\hfill{\LARGE \bf Andrei-Vlad Bădeliță}

\vspace*{60mm}
\begin{center}
\Huge{\bf Implementing Parallelism in Lisp for REDUCE} \\
\vspace*{5mm}
Part II Computer Science Dissertation \\
\vspace*{5mm}
Trinity College \\
\vspace*{5mm}
\today  % today's date
\end{center}

\cleardoublepage
#+END_EXPORT

#+LATEX: \newpage

\pagestyle{plain}

\section*{Declaration of originality}

I, Andrei-Vlad Bădeliță of Trinity College,
being a candidate for Part II of the Computer Science Tripos,
hereby declare that this dissertation and the work described in it
are my own work, unaided except as may be specified below, and
that the dissertation does not contain material that has already
been used to any substantial extent for a comparable purpose.

Signed 

Date

\section*{Proforma}

TODO Write proforma
- Your candidate number.
- The Title of your Project.
- The Examination and Year.
- Word-count for the dissertation.
- Final line count: Number of lines written by the *student* in the final version of their software work.
- Project Originator.
- Project Supervisor.
- At most 100 words describing the original aims of the project.
- At most 100 words summarising the work completed.
- At most 100 words describing any special difficulties that you faced. 


#+LATEX: \newpage

#+TOC: headlines 2

** Integrating threads
After familiarising myself with the VSL codebase I tried to implement the simplest form of
multi-threading and test out how the language would behave. I added a new function to VSL
which would takes a piece of code as an argument, starts a new thread and joins again with
the main thread. Once implemented, I could run first and simplest unit test for ParVSL:

#+BEGIN_SRC lisp
(dotimes (i 4) (thread '(print "Hello World")))
#+END_SRC
#+RESULTS:
: "Hello World"
: "Hello World"
: "Value: Hello Worln"Hello Woird"
: ld"

We can immediately observe the effects of parallelism in action. At this point, the code above
is just about the only working example. The interpreter is non thread-safe and data races
on global variables (including printing to the same stream) lead to undefined behaviour. Printing
still seems to work, however most other functions would fail. The spawned threads can only handle strings
and will crash on handling numbers or symbols, or when trying to allocate anything. 
There is no inter-thread communication, exception safety, and any garbage collection would produce a segmentation
fault. To be able to write a more complicated test, I need to make changes in all ares of the compiler.  

To manage the threads, I made futher use of the C++11 standard library. I created a global hashmap storing
all the running threads. Creating and joining a thread is done under a mutex lock. Each thread is assigned its own unique
identifier, which is returned to the user. The user can then use the identifier to join the thread.

** Threads

To start a thread, the user
simply needs to call the ~thread~ function. This function takes as arguments a function name and the argument list
and a unique thread id is returned. The function is applied to the arguments in a new thread. The return value
is stored until the user call ~thread_join~ on the thread id, when they can access the respective value. 

#+BEGIN_SRC 
tid := thread('add, {2, 3});
result := thread_join tid;
print result;
#+END_SRC
#+RESULTS:
: 5

This allows for simple inter-thread communication, through function parameters and returns. Any function can
be run in parallel by simply applying thread on it. This task based approach makes it easy to modify
single-threaded algorithms to run in parallel.

My implementation minimises overhead. The list of arguments is managed on the heap which is visible by all
threads, so a simple pointer is enough to pass them. For returning values, I must keep track of all
unjoined threads and their return values. I do this with a simple hashtable, mapping thread ids to their
return values. When a thread returns from its function, I update the hashtable with the returned value.
When the user joins a thread, I look up the value in the table, return it, then erase the mapping. All threads
have unique ids for the lifetime of the program, so there will never be conflicts in the hashtable.
This hashtable has to be thread-safe, and I have implemented it as described in Lock-free hashtable.

I must also be careful to prevent the garbage collector from collecting these parameters and return values.
Starting a thread is GC-safe: garbage collection will not begin while a new thread is starting up. This ensures
that threads are always in a safe state and registered in the thread-table correctly during garbage collection.
At that point, function parameters are tracked just like regular variables so they will be safe from GC.
However, return values are stored past the lifetime of their respective threads. To deal with them, I add them
to the root set at the beginning of garbage collection. 

The handling of both of these root sets has to account for multiple running threads. All the new
thread-local storage was added to the unambiguous root set. Additionally, each thread is running its
own stack so all the stacks has to be accounted for as the ambiguous root set. The latter is more complicated.
All threads have to be paused before garbage collection can begin so that they do not interfere
with memory. A simple way to do this is to enable a global flag which all threads check on a regular basis.
However, if we are not careful, this can easily cause a deadlock (e.g: thread A waits for a signal from
thread B, but thread B is waiting for garbage collection). To solve such issues, I need to make two
changes. First, I must modify the functions in the interpreter to poll the global flag. Then I have
to make all waiting calls put a thread into a /safe/ state before sleeping, so that the garbage collector
can proceed with the thread. 
